Revit 2024 API
ExportLineweightInfo Constructor (ExportLineweightInfo)
 Constructs a new copy of the input ExportLineweightInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportLineweightInfo(
	ExportLineweightInfo other
)
Visual Basic
Public Sub New ( _
	other As ExportLineweightInfo _
)
Visual C++
public:
ExportLineweightInfo(
	ExportLineweightInfo^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExportLineweightInfo
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportLineweightInfo Class
ExportLineweightInfo Overload
Autodesk.Revit.DB Namespace